Revit 2027 API
SweptBlend.SelectedPath Property
The selected curve used for the swept blend path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve SelectedPath { get; }
Public ReadOnly Property SelectedPath As Curve
	Get
public:
property Curve^ SelectedPath {
	Curve^ get ();
}
member SelectedPath : Curve with get
Property Value
Curve
Remarks
If the swept blend is based on a sketched path, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace